resources/information/technologies/xml/webServices/soap/structure/src/simpleEnrollMessage.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tr="http://solms.co.za/example/training"
    xmlns:p="http://solms.co.za/example/people">
    <soap:Body>
        <tr:enrollment>
            <tr:event>
                <tr:course>
                    <tr:name>Programming in Java</tr:name>
                    <tr:id>672</tr:id>
                </tr:course>
                <tr:date>2005-01-31</tr:date>
            </tr:event>
            <tr:candidate>
                <p:name>Koos</p:name>
                <p:surName>Kombuis</p:surName>
                <p:email>koos@kombuis.co.za</p:email>
                <p:phone>555-5555</p:phone>
            </tr:candidate>
            <tr:billingAddress>
                ...
            </tr:billingAddress>
        </tr:enrollment>
    </soap:Body>
</soap:Envelope>